docs: how to project works
